# parameters
nc: 80  # number of classes
depth_multiple: 0.5  # model depth multiple
width_multiple: 0.5  # layer channel multiple

# anchors
anchors:
  3

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2, None, 1, nn.ReLU(inplace=True)]], # Conv1 /2
  [-1, 1 , nn.MaxPool2d, [3, 2, 1]], # 3x3 Max pool /4
   [-1, 6, DenseBlock, [256]],
   [-1, 1, DenseNetTrasition, [128]],  # 3-P3/8
   [-1, 8, DenseBlock, [512]],
   [-1, 1, DenseNetTrasition, [256]],  # 5-P4/16
   [-1, 12, DenseBlock, [1024]],
   [-1, 1, DenseNetTrasition, [512]],  # 7-P5/32
   [-1, 8, DenseBlock, [2048]],
   [-1, 1, SPP, [2048, [5, 9, 13]]],
   [-1, 3, C3, [2048, False]],  # 10
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [1024, 1, 1]],
   #[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Sum, [2, True]],  # cat backbone P4
   [-1, 3, C3, [1024, False]],  # 14

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Sum, [2, True]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Sum, [2, True]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 22 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 17, 4], 1, Sum, [3, True]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 25 (P4/16-medium)

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 13, 6], 1, Sum, [3, True]],  # cat head P4
   [-1, 3, C3, [1024, False]],  # 28 (P4/16-medium)

   [-2, 1, Conv, [2048, 3, 2]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Sum, [2, True]],  # cat head P5
   [-1, 3, C3, [2048, False]],  # 31 (P5/32-large)

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
