
# Based on YOLOv5 L, with the addition of changes to neck and head to accomodate anchors at a larger level with fewer contextual
# features but more granularity in scale of smaller objects. 
# Expecting to take longer to tran efficiently on smaller objects 

# https://github.com/ultralytics/yolov5/issues/1418

# parameters
nc: 80  # number of classes
depth_multiple: 0.5  # model depth multiple
width_multiple: 0.5  # layer channel multiple

# anchors
anchors:
  3

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2, None, 1, nn.ReLU(inplace=True)]], # Conv1 /2
  [-1, 1 , nn.MaxPool2d, [3, 2, 1]], # 3x3 Max pool /4
   [-1, 6, DenseBlock, [256]],
   [-1, 1, DenseNetTrasition, [128]],  # 3-P3/8
   [-1, 8, DenseBlock, [512]],
   [-1, 1, DenseNetTrasition, [256]],  # 5-P4/16
   [-1, 12, DenseBlock, [1024]],
   [-1, 1, DenseNetTrasition, [512]],  # 7-P5/32
   [-1, 8, DenseBlock, [1024]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 10
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [1024, False]],  # 14

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 3, C3, [256, False]],  # 22 (P3/4-Xsmall)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [512, False]],  # 25 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [1024, False]],  # 28 (P4/16-medium)

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 31 (P5/32-large)

   [[22, 25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(p2, P3, P4, P5)
  ]
