# parameters
nc: 80  # number of classes
depth_multiple: 0.75  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors
anchors:
  3

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2, None, 1, nn.ReLU(inplace=True)]], # Conv1 /2
  [-1, 1 , nn.MaxPool2d, [3, 2, 1]], # 3x3 Max pool /4
   [-1, 6, DenseBlock, [256]],
   [-1, 1, DenseNetTrasition, [128]],  # 3-P3/8
   [-1, 8, DenseBlock, [512]],
   [-1, 1, DenseNetTrasition, [256]],  # 5-P4/16
   [-1, 12, DenseBlock, [1024]],
   [-1, 1, DenseNetTrasition, [512]],  # 7-P5/32
   [-1, 8, DenseBlock, [1024]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 10
  ]

# YOLOv5 head
head:
  [[-1, 3, BottleneckCSP, [1024, False]],  # 11 (P5/32-large)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [1024, 1, 1]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 15 (P4/16-medium)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 3, BottleneckCSP, [512, False]],  # 19 (P3/8-small)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 3, BottleneckCSP, [256, False]],  # 23 (P3/8-Xsmall)

   [[23, 18, 14, 10], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]