# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple

# anchors
anchors:
  3

# Resnet-50 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2, None, 1, nn.ReLU(inplace=True)]], # Conv1 /2
  [-1, 1 , nn.MaxPool2d, [3, 2, 1]], # 3x3 Max pool /4
  [-1, 3, ResNetBlock, [256, False]], # Conv2 /4
  [-1, 4, ResNetBlock, [512]], # Conv3 /8
  [-1, 6, ResNetBlock, [1024]], # Conv4 /16
  [-1, 3, ResNetBlock, [2048]], # Conv4 /32
  [-1, 1, SPP, [2048, [5, 9, 13]]],
  [-1, 3, C3, [2048, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [1024, False]],  # 13

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [1024, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [2048, False]],  # 23 (P5/32-large)

   [[14, 17, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
